IDENTIFICATION DIVISION.
PROGRAM-ID. SNAFU-CONVERTER.
AUTHOR. Guillaume Alleon.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE
        ASSIGN TO "inputs/2022/25"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD.
    05 SNAFU-NUMBER PIC X(200).
*> Define variables here

WORKING-STORAGE SECTION.
*> this is a signed 15 digits value integer
01 RESULT-VALUE PIC S9(15).
01 RESULT-STRING PIC X(200) VALUE " ".
01 TEMP-VALUE PIC S9(15).
01 REMAIN PIC S9.
01 I PIC 9(2) BINARY VALUE 0.
01 LENGTH-OF-NUMBER PIC 9(2).
01 END-OF-FILE PIC Z(1).
01 EXPONENT PIC 9(2).

PROCEDURE DIVISION.
BEGIN.
    MOVE 0 TO RESULT-VALUE
    OPEN INPUT INPUT-FILE
    READ INPUT-FILE INTO INPUT-RECORD
        AT END MOVE 1 TO END-OF-FILE
    END-READ
    IF END-OF-FILE = "Y"
        DISPLAY "File is empty"
        CLOSE INPUT-FILE
    END-IF
    MOVE 0 TO END-OF-FILE
    PERFORM UNTIL END-OF-FILE = 1
        COMPUTE LENGTH-OF-NUMBER = FUNCTION LENGTH(FUNCTION TRIM(SNAFU-NUMBER, TRAILING));

        MOVE 0 TO TEMP-VALUE

        MOVE LENGTH-OF-NUMBER TO I
        PERFORM UNTIL I = 0
            COMPUTE EXPONENT = LENGTH-OF-NUMBER - I

            IF SNAFU-NUMBER(I:1) = "="
                COMPUTE TEMP-VALUE = TEMP-VALUE - 2 * (5 ** EXPONENT)
            END-IF
            IF SNAFU-NUMBER(I:1) = "-"
                COMPUTE TEMP-VALUE = TEMP-VALUE - 1 * (5 ** EXPONENT)
            END-IF
            IF SNAFU-NUMBER(I:1) = "0"
                COMPUTE TEMP-VALUE = TEMP-VALUE
            END-IF
            IF SNAFU-NUMBER(I:1) = "1"
                COMPUTE TEMP-VALUE = TEMP-VALUE + 1 * (5 ** EXPONENT)
            END-IF
            IF SNAFU-NUMBER(I:1) = "2"
                COMPUTE TEMP-VALUE = TEMP-VALUE + 2 * (5 ** EXPONENT)
            END-IF
            *>DISPLAY "  Temp value is " TEMP-VALUE

            SUBTRACT 1 FROM I
        END-PERFORM

        COMPUTE RESULT-VALUE = RESULT-VALUE + TEMP-VALUE
        READ INPUT-FILE INTO INPUT-RECORD
            AT END MOVE 1 TO END-OF-FILE
        END-READ
    END-PERFORM
    CLOSE INPUT-FILE
    MOVE RESULT-VALUE TO TEMP-VALUE
    PERFORM UNTIL RESULT-VALUE = 0
        COMPUTE TEMP-VALUE = RESULT-VALUE / 5
        COMPUTE REMAIN = RESULT-VALUE - (TEMP-VALUE * 5)
        IF REMAIN > 2
            ADD 1 TO TEMP-VALUE
            ADD -5 TO REMAIN
        END-IF
        MOVE TEMP-VALUE TO RESULT-VALUE
        IF REMAIN = -2
            MOVE FUNCTION CONCATENATE("=", FUNCTION TRIM(RESULT-STRING)) TO RESULT-STRING
        END-IF
        IF REMAIN = -1
            MOVE FUNCTION CONCATENATE("-", FUNCTION TRIM(RESULT-STRING)) TO RESULT-STRING
        END-IF
        IF REMAIN = 0
            MOVE FUNCTION CONCATENATE("0", FUNCTION TRIM(RESULT-STRING)) TO RESULT-STRING
        END-IF
        IF REMAIN = 1
            MOVE FUNCTION CONCATENATE("1", FUNCTION TRIM(RESULT-STRING)) TO RESULT-STRING
        END-IF
        IF REMAIN = 2
            MOVE FUNCTION CONCATENATE("2", FUNCTION TRIM(RESULT-STRING)) TO RESULT-STRING
        END-IF
    END-PERFORM
    DISPLAY FUNCTION TRIM(RESULT-STRING)
STOP RUN.
